title: LSASS Process Access From Suspicious Source
id: 8d2b1b23-4f7f-4dc2-a8ac-9f5ed9d2db11
status: experimental
description: Detects suspicious process access to LSASS that may indicate credential dumping.
author: Misbah Ur Rehman
date: 2026-05-24
references:
  - https://attack.mitre.org/techniques/T1003/001/
tags:
  - attack.credential_access
  - attack.t1003.001
logsource:
  product: windows
  category: process_access
detection:
  selection:
    TargetImage|endswith: '\lsass.exe'
    GrantedAccess|contains:
      - '0x1010'
      - '0x1410'
      - '0x147a'
      - '0x143a'
  filter_legit:
    SourceImage|endswith:
      - '\MsMpEng.exe'
      - '\svchost.exe'
      - '\lsass.exe'
  condition: selection and not filter_legit
falsepositives:
  - Legitimate EDR or AV products
  - Authorized administrative troubleshooting
level: high
